# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Binaries
brew "bat"
brew "coreutils" # Those that come with macOS are outdated
brew "deno"
brew "docker"
brew "gh"
brew "git"
brew "mailhog" # For local email testing
brew "pnpm"
brew "zsh-syntax-highlighting"

# Apps
cask "brave-browser"
cask "docker"
cask "httpie"
cask "iterm2"
cask "raycast"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "zed"

# Fonts
cask "font-jetbrains-mono"
