# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Binaries
brew "bat"
brew "neovim"
brew "lazygit"
brew "eza"
brew "ripgrep"
brew "coreutils" # Those that come with macOS are outdated
brew "docker"
brew "gh"
brew "git"
brew "git-delta"
brew "zsh-syntax-highlighting"

# Apps
cask "brave-browser"
cask "docker"
cask "httpie"
cask "ghostty"
cask "raycast"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono"
